 #ifndef __ACPDUCOM_H
#define __ACPDUCOM_H
/*********************************************************************************************************************
*                                            头文件包含
*********************************************************************************************************************/
#include "../../app/global.h"
#include "../../app/includes.h"

/*********************************************************************************************************************
*                                            宏定义
*********************************************************************************************************************/
#define URAT_REG          	0X00	  //电压寄存器 
#define IRAT_REG          	0X01	  //电流寄存器 

#define VOLT_REG          	0X10A	  //电压寄存器 
#define CURR_REG          	0X110	  //电流寄存器 

#define ST_REG         		0X11C	  //合相视在功率寄存器
#define PT_REG         		0X124	  //合相总有功功率寄存器
#define QT_REG         		0X12c	  //合相无功功率寄存器
#define PFT_REG        		0X134	  //功率因数寄存器

#define P_WH_REG         	0X13C	  //电能寄存器 
#define HUA_REG          	0XF4	  //A相电压谐波
#define HUB_REG          	0XF5	  //B相电压谐波
#define HUC_REG          	0XF6	  //B相电压谐波
#define HIA_REG          	0XF7	  //A相电流谐波
#define HIB_REG          	0XF8	  //B相电流谐波
#define HIC_REG          	0XF9	  //C相电流谐波









#endif

